const projectList = [
    {
        title: "电控",
        type: "紧急采购",
        details: [
            "资质认证:IATF16949",
            "适用车型:乘用车-新能源车",
            "地理位置:中国"
        ],
        publishedTime: "3小时前",
        publishDateTime: "2025-08-27 14:40", // 17:40 - 3小时
        company: "加特可（广州）自动变速箱...",
        enrolled: "7家已报名"
    },
    {
        title: "PVC面料",
        type: "储备采购",
        details: [
            "资质认证:IATF16949",
            "适用车型:乘用车-燃油车,乘用车-新能源车",
            "项目周期:2025-08-27~2025-08-28"
        ],
        publishedTime: "5小时前",
        publishDateTime: "2025-08-27 12:40", // 17:40 - 5小时
        company: "某外资一级企业",
        enrolled: "4家已报名"
    },
    {
        title: "液压油泵",
        type: "紧急采购",
        details: [
            "采购数量:10万件以上/年",
            "资质认证:IATF16949",
            "适用车型:乘用车-新能源车"
        ],
        publishedTime: "8小时前",
        publishDateTime: "2025-08-27 09:40", // 17:40 - 8小时
        company: "某外资一级",
        enrolled: "2家已报名"
    },
    {
        title: "文丘里混合器",
        type: "紧急采购",
        details: [
            "资质认证:IATF16949",
            "适用车型:商用车-燃油车,商用车-新能源车",
            "地理位置:中国"
        ],
        publishedTime: "8小时前",
        publishDateTime: "2025-08-27 09:40",
        company: "某民营一级",
        enrolled: "0家已报名"
    },
    {
        title: "快速样件",
        type: "紧急采购",
        details: [
            "资质认证:IATF16949",
            "适用车型:乘用车-燃油车,乘用车-新能源车",
            "地理位置:中国"
        ],
        publishedTime: "1天前",
        publishDateTime: "2025-08-26 17:40", // 17:40 - 24小时
        company: "某外资一级",
        enrolled: "1家已报名"
    },
    {
        title: "表面处理（超声波清洗）",
        type: "紧急采购",
        details: [
            "采购数量:20万件/月",
            "资质认证:其他",
            "适用车型:乘用车-燃油车,乘用车-新能源车"
        ],
        publishedTime: "1天前",
        publishDateTime: "2025-08-26 17:40",
        company: "某外资一级",
        enrolled: "8家已报名"
    },
    {
        title: "EMB齿轮",
        type: "储备采购",
        details: [
            "采购数量:1-5万件台每年",
            "资质认证:IATF16949",
            "适用车型:乘用车-燃油车,乘用车-新能源车"
        ],
        publishedTime: "1天前",
        publishDateTime: "2025-08-26 17:40",
        company: "某一级供应商",
        enrolled: "11家已报名"
    },
    {
        title: "弹簧",
        type: "紧急采购",
        details: [
            "资质认证:IATF16949",
            "适用车型:乘用车-燃油车,乘用车-新能源车",
            "项目周期:2025-08-25~2025-08-25"
        ],
        publishedTime: "1天前",
        publishDateTime: "2025-08-26 17:40",
        company: "某外资一级企业",
        enrolled: "8家已报名"
    },
    {
        title: "低压电机总成",
        type: "储备采购",
        details: [
            "采购数量:10万件/年",
            "资质认证:IATF16949",
            "适用车型:乘用车-燃油车,乘用车-新能源车"
        ],
        publishedTime: "1天前",
        publishDateTime: "2025-08-26 17:40",
        company: "某外资一级",
        enrolled: "4家已报名"
    },
    {
        title: "直流有刷电机",
        type: "紧急采购",
        details: [
            "采购数量:1万件/年",
            "资质认证:IATF16949",
            "适用车型:乘用车-新能源车,商用车-燃油车"
        ],
        publishedTime: "1天前",
        publishDateTime: "2025-08-26 17:40",
        company: "某一级企业",
        enrolled: "3家已报名"
    }
];
const filterParams = [
    [
        "动力系统",
        "冷却系统",
        "配气系统",
        "发动机总成",
        "点火系统",
        "进排气系统",
        "发动机基本零部件",
        "其他",
        "汽油机燃油供给系",
        "柴油机燃油供给系"
    ],
    [
        "车身内外饰",
        "座椅及附件",
        "内饰件",
        "车门及附件",
        "其他",
        "雨刮器、洗涤器",
        "车身本体白车身",
        "车镜",
        "外饰件"
    ],
    [
        "底盘",
        "车桥",
        "其他",
        "自动变速器",
        "转向系统",
        "车轮及附件",
        "底盘模块",
        "限滑差速器",
        "离合器",
        "轮胎",
        "车架",
        "驱动桥",
        "四驱驱动传输",
        "变速器",
        "制动系统",
        "悬架系统"
    ],
    [
        "电子电器",
        "电机",
        "线束&接头",
        "发电机、起动机",
        "电子零件",
        "一体成型电感",
        "安全系统",
        "空调系统",
        "喇叭",
        "电子控制单元",
        "视听影音&通讯导航",
        "车载电器",
        "传感器",
        "蓄电池",
        "照明系统",
        "仪表",
        "其他"
    ],
    [
        "通用件",
        "紧固件",
        "弹簧",
        "皮带",
        "轴承",
        "玻璃",
        "拉索",
        "阀门",
        "密封件",
        "衬套",
        "悬置",
        "管件&管路",
        "齿轮"
    ],
    [
        "模具及工艺件",
        "塑料件",
        "橡胶件",
        "模具",
        "机加工件",
        "快速成型",
        "铸造",
        "冲压",
        "锻造",
        "粉末冶金"
    ],
    [
        "电动化",
        "整车系统",
        "驱动电机",
        "动力电池系统",
        "驱动系统",
        "燃料电池系统",
        "充电设施与系统",
        "设备及工具",
        "辅助部件"
    ],
    [
        "智能网联",
        "出行服务",
        "自动驾驶解决方案",
        "高级辅助驾驶系统",
        "环境感知",
        "算法",
        "汽车开发测试",
        "TSP服务",
        "网络通讯",
        "智能座舱"
    ],
    [
        "原材料工具设备",
        "原材料",
        "设备",
        "工具",
        "轻量化"
    ]
]

export {
    projectList,
    filterParams
}